using IntroOOP;

Header.HwHeader("ООП", 5, "Алимов Филипп");

//Создать класс рациональных чисел. В классе два поля – числитель и
//знаменатель. Предусмотреть конструктор. Определить операторы ==, != (метод
//Equals()), <, >, <=, >=, +, – , ++, --.Переопределить метод ToString() для вывода
//дроби. Определить операторы преобразования типов между типом дробь, float, int.
//Определить операторы *, /, %.

RatNum rat1 = new(5, 6);

//var rat2 = new RatNum(4, 9);
//var rat3 = new RatNum(1, 2);
//int a = 2;
//int b = 3;
//Console.WriteLine(rat1 + a);
//Console.WriteLine(b + rat1);
//Console.WriteLine(rat1 + rat2);
//Console.WriteLine(rat1 - rat3);
//Console.WriteLine(rat1 * rat2);
//Console.WriteLine(++rat1);

Console.ReadLine();